import java.util.ArrayList;
import java.util.List;
import java.util.Map;

public class test{
    public static void test4Preprocess(){
        List<String> titles= new ArrayList<String>();
        List<String> docs=new ArrayList<String>();
        titles.add("富力惠兰美居官方消息 早上6点就有申购者涌向接待中心");
        docs.add("4月11日富力惠兰美居现场审核工作正式拉开帷幕，早上6点左右便有申购者不断涌向项目的接待中心，多数人都是全家总动员，大家饶有兴致的前来等候审核。8点左右项目审核开始，此时，外围人群已经排成了几条长龙。现场更是人潮拥挤，热闹非凡，在工作人员的有序安排下，大家依次排队、选号等候。外围排队等候进场的人群进场后拿号等待上楼参加审核据统计，当天共有约3000余组家庭前来办理，为缓解现场过大的人流，富力惠兰美居的工作人员采取分段截流方式，从外围到内场将等候人群分成三部分，确保不至于发生错乱。在接待中心的二层审核现场，蕙兰美居对每一户申购家庭的审核资料进行了认真核对与整理，在紧张有序的工作中，项目人员服务热情，耐心询问有关编号、证件、家庭成员资料等信息，悉心解答每一个问题。在审核完毕后，更有专人引导出场，细心之处如此，获得了大家的一致认同。休息区内大家耐心的等候二层大厅正在接受审核的申购者下午17时左右，审核工作顺利告一段落，一整天的忙碌与等待着实显示出自住型商品房的异常火爆。鉴于此，富力惠兰美居特别提醒各位申购者，请您错峰前来审核，我们的审核周期为2014年4月11日——2014年5月12日，审核先后顺序与选房排号无关，您大可合理安排时间前往现场。温馨提示：由于市建委网站于下午17:30关闭，故17:30以后不能进行资格审核，敬请谅解！有关富力惠兰美居自住型商品房的审核事宜，项目组会以短信形式分批次告知，请多加留意；相关审核进度及安排，我们会及时公布于官网，请及时跟进项目最新动态或致电010-59037677本贴转自：血拼自住商品房论坛社区论坛：http://house.focus.cn/msglist/2500017/原贴链接：http://house.focus.cn/msgview/2500017/295333356.html");
        titles.add("北京自住型商品房售楼处观感（一）：恒大御景湾");
        docs.add("北京自住型商品房售楼处观感（一）：恒大御景湾2013年11月，北京市自住型商品房问世，受到各方关注。在足球领域风生水起的恒大集团，成为这个新生事物第一个吃螃蟹的公司。此后，吃螃蟹的地产公司越来越多。住建部也肯定了北京市的这个做法，认为是推进共有产权住房的有益尝试。看来，共有产权商品房将成为今后一个时期支持中端刚需和改善性住房需求的主要产品。购买自住型商品房，少不了要跟售楼处打交道。从今天起，我把到这些自住型商品房的售楼处的观感给描述一下。本人声明，只做客观描述，夹杂一些主观感受，没有恶意误导。一、网申御景湾恒大御景湾的官网好难登录，开放报名的前三天，基本刷不进去。我就知道凑热闹的人太多，索性不急，等到第七八天了，轻松登录，把信息填好，完成网申。由于我名下无住房，可以列入优先群体。过完元旦，有个周末睡懒觉，忽然被手机铃声吵醒。恒大御景湾的工作人员，语速很快，普通话比较标准。很麻利地问我：前几天的现场审核短信，你是否收到。我迷迷糊糊地答道：收到了。再问：情况都清楚吧。我答：都清楚。最后说：那请您届时带好户口本、结婚证、身份证及复印件，按照规定的时间到售楼处现场审核，谢谢。我说：没问题。电话就挂了。我呢？继续睡觉。这个电话没有给我带来什么惊喜，短信早就收到了，一切都是意料之中的事。而且，审核资料只是完成网申后，申购程序的第一步。后面的事还多着呢。二、现场排队1月21日中午吃完饭，给领导请了一会儿假，开车前往售楼处，赶1点钟开始的我所在这一波的审核。广安门-经西二环到复兴门-经长安街到四惠桥-经东四环到红领巾桥-朝阳北路-抵达东五环外的白家楼区域。12点出门，12点50左右抵达。基本一路畅通（东长安街有点堵）。路过宝蓝康达广场，大冷天已经排了好长的队。我一想，坏了，搞不好要排一下午队了。附近大片的空地，停车没问题。我自觉站在队尾，没多久后面就又站了几十号人。1点钟，队伍开始缓慢移动。这个距离广场门口大概二三百米的大队，真够吓人的。闲着无聊，我就跟前后的人聊起天来。前面站着一对母女。女孩个子高挑，相貌姣好，一打听，28岁了还没结婚——北京的大龄女青年还真不少，所以北京男生别急着谈朋友结婚，选择余地还很大，呵呵。母亲就是本地人，家里有房，但房本写的爷爷奶奶的名字。所以，母女名下都没房，都是优先，可以拿到两个编号，增加中签几率。比较可笑的是，母亲竟然不知道恒大御景湾的工地在哪，卖多少钱。她一直以为售价10000出头.不知道她从哪儿听到的消息。觉得花100万买个90平米的房，还挺合算，难怪这么多人排队。大家都在笑话她。工地距离这里的售楼处大概10多公里。在东南五环外的豆各庄，现在还是工地，两年后才竣工入住，早着呢。单价22000，一套90平米200万呢。这位母亲一听，嘴巴张成了圆形。她说，这么贵，还这么多人跑来凑热闹，是不是都有钱烧得慌！我呵呵一笑，没说啥，大家也没说啥。还是那位高个女儿说了句：妈，现在就这行情，没办法。我相信，像这位母亲一样，对要花钱买的这个房子一点都不了解的情况，恐怕有的是。三、递交材料队伍排得很快，据说里面有几十个窗口在办手续，效率比较高。因为跟人聊天，所以也不觉得排队时间太久。很快就排进了售楼处。看得出来，有些家庭是好几个人来办手续的。看来，他们真的对这个自住房很看重，很当回事。不过，由于现场排队人多，保安只允许主申请人自己进去，其他人只能在外边等着。最苦逼的当属几个孕妇，由于是主申请人，只好离开陪护在旁的丈夫，独自进入转圈排队的循环里。年轻的丈夫，眼神里满是心疼，站在门口久久不愿离去（当然，外头有点冷，门口还暖和点）。显然，这些丈夫没有北京户口，而作为孕妇的妻子有北京户口。一张蓝色的户口单，就将人划分为三六九等。公平吗？答案显然是否定的。然而，对于这个特大城市来说，不用户口和房价作为门槛，那么人不都挤爆了吗？排到一个入口处，有个取号机，拿了号码就坐着等叫。大概10分钟后叫到了我。在柜台前，我把两口子的户口卡（含盖章主页）、两口子身份证和结婚证都拿了出来，包括全套复印件，并且报了我的申购编码。工作人员麻利地登记完后，退回证件，是否收走了复印件我忘记了。然后打印一张信息单，让我牢记摇号编码，作为今后参加所有自住房摇号的唯一凭证。我用手机拍了下来，免得手写抄错。她问我：未来的房产证写谁的名字。我说写我的。她问：爱人呢？我说，没问题，写我的，我们俩已经商量好了。写我一人的，几年后如果卖出，我一个人去跑腿就行，不必烦劳俩人请假。而且房本有没有她的名字，都是婚后共同财产，法律保护的。她说：那好，以后所有的自住房都照此办理咯，无论你摇到哪个项目，房本都只写你自己的名字咯。我说：行。我也反问了她几个问题：一是什么时候摇号，二是户型图和沙盘何时推出。得到的答案是，恒大这边资料审核完毕后，会送到北京市住建委复审资格，预计20个工作日才能审完。而恒大的资料审核要到2月底3月初。所以，北京市住建委大概4月初能办完复审就不错了。开盘摇号怎么也得五六月了吧。至于户型图和沙盘，摇号之前会有的，具体时间我也不知道。好吧，一切都是未知数。办完手续，我离开现场。打开车门，看看表，大概2点。排队办手续花了1小时。这个效率算高的了。再看广场外边，基本已经看不到排队的人了。按照网站通知，3点还会来一波，届时又是大长队。四、两点感受（一）苦逼的80后排队的间隙，大概观察了周围的男生女生，大多数是带着结婚证、户口本或户籍卡来的。显然，都是跟我年龄相仿或略小一点的80后。想想80后其实很可悲。父辈赶上下乡和下岗，靠考大学、下海出头的终归是少数。多数人其实没什么积蓄来支持孩子买房。80后自己呢？生在计划生育的时代，没有兄弟姐妹。赶上大学扩招，比自己差的都能混大学了。大学毕业发现到处都是大学生，工作很难找。好不容易就业了，发现薪水涨幅跟不上物价和房价。想结婚时，发现根本买不起房，连租房都租不起，安个家好难。为了一套小房子，要搭上三家人几辈子的辛苦钱，外加一屁股债。尤其是动用父辈的棺材钱，这是不是很残酷！更可恶的是，教改在继续坑80后的下一代，而且养孩子的费用高企；医改让80后对自己退休后的福利毫无预期，照样看不起病；交的社保都寅吃卯粮地反哺现在的退休者，等到80后退休时，没准社保基金早就贬值得一塌糊涂了。驱动房价上涨的一代决策者，大概是40后。他们的后代（60后、70后）赶上了福利分房的末班车，以极低的成本完成了原始积累，高价卖房谋取暴利，把市场风险和包袱甩给80后，把自己的幸福和潇洒建立在80后的痛苦基础上。而90后呢？住着60后和70后为他们买好的房子，还有多少人会给80后接盘呢？显然，在这场击鼓传花的游戏里，80后可能是最后一棒，或许被套牢，或许有价无市，难以变现。房地产的野蛮生长，使不同年龄段的人群，生活状态、精神风貌有很大的差别。这种断裂将越发凸显。80后是塌陷的一代，是牺牲品。所谓“一部分人先富起来”，不应该是以阻挡“长江后浪”追求幸福的努力，不应当是以牺牲后代的幸福为代价的。然而，现在前辈们所做的一切，就是在透支下几代人的幸福（比如环境污染），说句难听话，叫“绝后”。这就像现在的雾霾天气，归咎于汽车是不公道的。如果没有四万亿和GDP保8，很多污染项目不会急急忙忙上马，恐怕北京和华北地区的空气质量不会这么差。没办法，在眼前利益和长远利益面前，只有五年或十年任期的决策者，只能短视。因为，短视对他最有利。他可以带着政绩扬长而去，管他日后洪水滔天。雾霾和房地产，其实问题的根子都一样，就是管理理念。对此，我很担心。但是，作为小民，你担心也没用。（二）关于自住房申购人数我相信，免费网申带来的必然是大量人前来凑热闹。他们不管自己有没有实力，是不是需要，反正都抱着抓彩票的心态来搅局，导致恒大北京的网站瘫痪多日。不知道这些人居心何在。恒大方面早就说了，15天申购期，排名不分先后，为何还非要抢前三天呢？脑残吗？我的判断被事实证明是正确的。网申恒大的总共14.8万户，其中优先有8万多户。将近15万人抢2000套房子，70多比1，是挺吓人的，快跟汽车摇号差不多了。难道，22000的单价，200万的总价，真的就像大白菜一样便宜吗？等到恒大现场审核完毕，通过审核的降到了6.53万户，其中优先有5万多户。水分挤干了第一遍。原来，有8万多户来玩票的，占一多半。6.53万户和5万多户这两个数据，真实地反映了北京目前无房户的基本情况。所以，北京市政府在两年内推出7万套自住房，应该说是有的放矢，可以满足广大夹心层的需求。当然，数量上基本够，质量、价格和地段另说。起码政府去做了，作为消费者，你爱要不要。根据不太可靠的消息透露，市住建委进行第二轮复查之后，优先群减少到1.2万户。这就意味着，恒大御景湾的客户和房源之比，已经降到了6:1。如果这个数据是真的，那么可以说明两个问题：第一，许多人的资料是造假的，真实的刚性需求没那么多。第二，没有户口的刚需还是很多的，他们没有资格进入优先群。我相信，待到摇号时，还会有一部分人放弃，二居室160万以上的总价，确实不便宜。豆各庄的基础配套，甚至还不如六环外的一些小镇。住房子，住的是环境，住的是品质，不是单纯去住地段的。还因为，由于商品房价企稳甚至有所下调，许多购房者还会愿意买商品房，而不是自住房，毕竟自住房产权不完整，交易限制多。（三）一点建议最近，东南五环外的台湖地块，东亚台湖印象的住宅价格就跌到了22900，包含精装修，甚至由于客户少，根本卖不完，只好放缓开盘节奏。台湖位于通州区西南部，与恒大御景湾地块的距离，大概也就10公里以内。走京哈高速，不堵车的话，10多分钟就够了。地铁七号线未来还会向东延长到台湖区域的环球影城，所以，恒大御景湾其实除了身在朝阳区之外，好像优势并不明显。其实，倘若出得起22000，台湖比豆各庄强。台湖是熟地，市政重新规划，未来还有升值潜力。豆各庄是化工厂的老地，市政改造难度太大。况且不必摇号，开盘去付钱就是了，比自住房省事多了。听说还有个叫“绿地启航国际”的楼盘，15800起价，好像降了不少。而且距离地铁15号线南法信站可能只有800米（没去过实地，有待核实）。想那赵全营单价14000的自住房，周围几乎零配套，我觉得还不如绿地的这个楼盘。我倒不是为东亚和绿地做广告，只是这样的降价案例，如果由个案变成普遍，自住房在中短期内的升值空间将大打折扣。由于自住房比两限房贵得多，届时一些地段偏远的自住房会不会因为价格优势不再明显而滞销、烂掉，砸在手里，谁也说不清。【完】本贴转自：血拼自住商品房论坛社区论坛：http://house.focus.cn/msglist/2500017/原贴链接：http://house.focus.cn/msgview/2500017/295348887.html");
  
        Preprocess tmp = new Preprocess();
        Docclassify docc= new Docclassify();
        tmp.setDocs(docs);
        tmp.settitles(titles);        
        tmp.initStopWordsAndStopNatures();
        tmp.analysisStr();
        
        double[]weight = {1,0.12};
        docc.setWeight(weight);
        docc.setDoc(tmp.getResult());
        
        String pos = "out_positive.txt";
        String neg = "out_negtive.txt";
        
        docc.addDictionary(Dictionary.GetDictionary(pos));
        docc.addDictionary(Dictionary.GetDictionary(neg));
        docc.run();
        List<Integer> Ans= docc.getKind();
        for (int i=0;i<Ans.size();i++){
            System.out.println(Ans.get(i));
        }
          
    }
    public static void test4Dictionary(){
        String pos = "out_positive.txt";
        String neg = "out_negtive.txt";

        Map<String,Double> negdic= Dictionary.GetDictionary(neg);

        
        Map<String,Double> posdic= Dictionary.GetDictionary(pos);
    }
    public static void test4PMI(){
        List<String> titles= new ArrayList<String>();
        List<String> docs=new ArrayList<String>();
        titles.add("富力惠兰美居官方消息 早上6点就有申购者涌向接待中心");
        docs.add("4月11日富力惠兰美居现场审核工作正式拉开帷幕，早上6点左右便有申购者不断涌向项目的接待中心，多数人都是全家总动员，大家饶有兴致的前来等候审核。8点左右项目审核开始，此时，外围人群已经排成了几条长龙。现场更是人潮拥挤，热闹非凡，在工作人员的有序安排下，大家依次排队、选号等候。外围排队等候进场的人群进场后拿号等待上楼参加审核据统计，当天共有约3000余组家庭前来办理，为缓解现场过大的人流，富力惠兰美居的工作人员采取分段截流方式，从外围到内场将等候人群分成三部分，确保不至于发生错乱。在接待中心的二层审核现场，蕙兰美居对每一户申购家庭的审核资料进行了认真核对与整理，在紧张有序的工作中，项目人员服务热情，耐心询问有关编号、证件、家庭成员资料等信息，悉心解答每一个问题。在审核完毕后，更有专人引导出场，细心之处如此，获得了大家的一致认同。休息区内大家耐心的等候二层大厅正在接受审核的申购者下午17时左右，审核工作顺利告一段落，一整天的忙碌与等待着实显示出自住型商品房的异常火爆。鉴于此，富力惠兰美居特别提醒各位申购者，请您错峰前来审核，我们的审核周期为2014年4月11日——2014年5月12日，审核先后顺序与选房排号无关，您大可合理安排时间前往现场。温馨提示：由于市建委网站于下午17:30关闭，故17:30以后不能进行资格审核，敬请谅解！有关富力惠兰美居自住型商品房的审核事宜，项目组会以短信形式分批次告知，请多加留意；相关审核进度及安排，我们会及时公布于官网，请及时跟进项目最新动态或致电010-59037677本贴转自：血拼自住商品房论坛社区论坛：http://house.focus.cn/msglist/2500017/原贴链接：http://house.focus.cn/msgview/2500017/295333356.html");
        titles.add("北京自住型商品房售楼处观感（一）：恒大御景湾");
        docs.add("北京自住型商品房售楼处观感（一）：恒大御景湾2013年11月，北京市自住型商品房问世，受到各方关注。在足球领域风生水起的恒大集团，成为这个新生事物第一个吃螃蟹的公司。此后，吃螃蟹的地产公司越来越多。住建部也肯定了北京市的这个做法，认为是推进共有产权住房的有益尝试。看来，共有产权商品房将成为今后一个时期支持中端刚需和改善性住房需求的主要产品。购买自住型商品房，少不了要跟售楼处打交道。从今天起，我把到这些自住型商品房的售楼处的观感给描述一下。本人声明，只做客观描述，夹杂一些主观感受，没有恶意误导。一、网申御景湾恒大御景湾的官网好难登录，开放报名的前三天，基本刷不进去。我就知道凑热闹的人太多，索性不急，等到第七八天了，轻松登录，把信息填好，完成网申。由于我名下无住房，可以列入优先群体。过完元旦，有个周末睡懒觉，忽然被手机铃声吵醒。恒大御景湾的工作人员，语速很快，普通话比较标准。很麻利地问我：前几天的现场审核短信，你是否收到。我迷迷糊糊地答道：收到了。再问：情况都清楚吧。我答：都清楚。最后说：那请您届时带好户口本、结婚证、身份证及复印件，按照规定的时间到售楼处现场审核，谢谢。我说：没问题。电话就挂了。我呢？继续睡觉。这个电话没有给我带来什么惊喜，短信早就收到了，一切都是意料之中的事。而且，审核资料只是完成网申后，申购程序的第一步。后面的事还多着呢。二、现场排队1月21日中午吃完饭，给领导请了一会儿假，开车前往售楼处，赶1点钟开始的我所在这一波的审核。广安门-经西二环到复兴门-经长安街到四惠桥-经东四环到红领巾桥-朝阳北路-抵达东五环外的白家楼区域。12点出门，12点50左右抵达。基本一路畅通（东长安街有点堵）。路过宝蓝康达广场，大冷天已经排了好长的队。我一想，坏了，搞不好要排一下午队了。附近大片的空地，停车没问题。我自觉站在队尾，没多久后面就又站了几十号人。1点钟，队伍开始缓慢移动。这个距离广场门口大概二三百米的大队，真够吓人的。闲着无聊，我就跟前后的人聊起天来。前面站着一对母女。女孩个子高挑，相貌姣好，一打听，28岁了还没结婚——北京的大龄女青年还真不少，所以北京男生别急着谈朋友结婚，选择余地还很大，呵呵。母亲就是本地人，家里有房，但房本写的爷爷奶奶的名字。所以，母女名下都没房，都是优先，可以拿到两个编号，增加中签几率。比较可笑的是，母亲竟然不知道恒大御景湾的工地在哪，卖多少钱。她一直以为售价10000出头.不知道她从哪儿听到的消息。觉得花100万买个90平米的房，还挺合算，难怪这么多人排队。大家都在笑话她。工地距离这里的售楼处大概10多公里。在东南五环外的豆各庄，现在还是工地，两年后才竣工入住，早着呢。单价22000，一套90平米200万呢。这位母亲一听，嘴巴张成了圆形。她说，这么贵，还这么多人跑来凑热闹，是不是都有钱烧得慌！我呵呵一笑，没说啥，大家也没说啥。还是那位高个女儿说了句：妈，现在就这行情，没办法。我相信，像这位母亲一样，对要花钱买的这个房子一点都不了解的情况，恐怕有的是。三、递交材料队伍排得很快，据说里面有几十个窗口在办手续，效率比较高。因为跟人聊天，所以也不觉得排队时间太久。很快就排进了售楼处。看得出来，有些家庭是好几个人来办手续的。看来，他们真的对这个自住房很看重，很当回事。不过，由于现场排队人多，保安只允许主申请人自己进去，其他人只能在外边等着。最苦逼的当属几个孕妇，由于是主申请人，只好离开陪护在旁的丈夫，独自进入转圈排队的循环里。年轻的丈夫，眼神里满是心疼，站在门口久久不愿离去（当然，外头有点冷，门口还暖和点）。显然，这些丈夫没有北京户口，而作为孕妇的妻子有北京户口。一张蓝色的户口单，就将人划分为三六九等。公平吗？答案显然是否定的。然而，对于这个特大城市来说，不用户口和房价作为门槛，那么人不都挤爆了吗？排到一个入口处，有个取号机，拿了号码就坐着等叫。大概10分钟后叫到了我。在柜台前，我把两口子的户口卡（含盖章主页）、两口子身份证和结婚证都拿了出来，包括全套复印件，并且报了我的申购编码。工作人员麻利地登记完后，退回证件，是否收走了复印件我忘记了。然后打印一张信息单，让我牢记摇号编码，作为今后参加所有自住房摇号的唯一凭证。我用手机拍了下来，免得手写抄错。她问我：未来的房产证写谁的名字。我说写我的。她问：爱人呢？我说，没问题，写我的，我们俩已经商量好了。写我一人的，几年后如果卖出，我一个人去跑腿就行，不必烦劳俩人请假。而且房本有没有她的名字，都是婚后共同财产，法律保护的。她说：那好，以后所有的自住房都照此办理咯，无论你摇到哪个项目，房本都只写你自己的名字咯。我说：行。我也反问了她几个问题：一是什么时候摇号，二是户型图和沙盘何时推出。得到的答案是，恒大这边资料审核完毕后，会送到北京市住建委复审资格，预计20个工作日才能审完。而恒大的资料审核要到2月底3月初。所以，北京市住建委大概4月初能办完复审就不错了。开盘摇号怎么也得五六月了吧。至于户型图和沙盘，摇号之前会有的，具体时间我也不知道。好吧，一切都是未知数。办完手续，我离开现场。打开车门，看看表，大概2点。排队办手续花了1小时。这个效率算高的了。再看广场外边，基本已经看不到排队的人了。按照网站通知，3点还会来一波，届时又是大长队。四、两点感受（一）苦逼的80后排队的间隙，大概观察了周围的男生女生，大多数是带着结婚证、户口本或户籍卡来的。显然，都是跟我年龄相仿或略小一点的80后。想想80后其实很可悲。父辈赶上下乡和下岗，靠考大学、下海出头的终归是少数。多数人其实没什么积蓄来支持孩子买房。80后自己呢？生在计划生育的时代，没有兄弟姐妹。赶上大学扩招，比自己差的都能混大学了。大学毕业发现到处都是大学生，工作很难找。好不容易就业了，发现薪水涨幅跟不上物价和房价。想结婚时，发现根本买不起房，连租房都租不起，安个家好难。为了一套小房子，要搭上三家人几辈子的辛苦钱，外加一屁股债。尤其是动用父辈的棺材钱，这是不是很残酷！更可恶的是，教改在继续坑80后的下一代，而且养孩子的费用高企；医改让80后对自己退休后的福利毫无预期，照样看不起病；交的社保都寅吃卯粮地反哺现在的退休者，等到80后退休时，没准社保基金早就贬值得一塌糊涂了。驱动房价上涨的一代决策者，大概是40后。他们的后代（60后、70后）赶上了福利分房的末班车，以极低的成本完成了原始积累，高价卖房谋取暴利，把市场风险和包袱甩给80后，把自己的幸福和潇洒建立在80后的痛苦基础上。而90后呢？住着60后和70后为他们买好的房子，还有多少人会给80后接盘呢？显然，在这场击鼓传花的游戏里，80后可能是最后一棒，或许被套牢，或许有价无市，难以变现。房地产的野蛮生长，使不同年龄段的人群，生活状态、精神风貌有很大的差别。这种断裂将越发凸显。80后是塌陷的一代，是牺牲品。所谓“一部分人先富起来”，不应该是以阻挡“长江后浪”追求幸福的努力，不应当是以牺牲后代的幸福为代价的。然而，现在前辈们所做的一切，就是在透支下几代人的幸福（比如环境污染），说句难听话，叫“绝后”。这就像现在的雾霾天气，归咎于汽车是不公道的。如果没有四万亿和GDP保8，很多污染项目不会急急忙忙上马，恐怕北京和华北地区的空气质量不会这么差。没办法，在眼前利益和长远利益面前，只有五年或十年任期的决策者，只能短视。因为，短视对他最有利。他可以带着政绩扬长而去，管他日后洪水滔天。雾霾和房地产，其实问题的根子都一样，就是管理理念。对此，我很担心。但是，作为小民，你担心也没用。（二）关于自住房申购人数我相信，免费网申带来的必然是大量人前来凑热闹。他们不管自己有没有实力，是不是需要，反正都抱着抓彩票的心态来搅局，导致恒大北京的网站瘫痪多日。不知道这些人居心何在。恒大方面早就说了，15天申购期，排名不分先后，为何还非要抢前三天呢？脑残吗？我的判断被事实证明是正确的。网申恒大的总共14.8万户，其中优先有8万多户。将近15万人抢2000套房子，70多比1，是挺吓人的，快跟汽车摇号差不多了。难道，22000的单价，200万的总价，真的就像大白菜一样便宜吗？等到恒大现场审核完毕，通过审核的降到了6.53万户，其中优先有5万多户。水分挤干了第一遍。原来，有8万多户来玩票的，占一多半。6.53万户和5万多户这两个数据，真实地反映了北京目前无房户的基本情况。所以，北京市政府在两年内推出7万套自住房，应该说是有的放矢，可以满足广大夹心层的需求。当然，数量上基本够，质量、价格和地段另说。起码政府去做了，作为消费者，你爱要不要。根据不太可靠的消息透露，市住建委进行第二轮复查之后，优先群减少到1.2万户。这就意味着，恒大御景湾的客户和房源之比，已经降到了6:1。如果这个数据是真的，那么可以说明两个问题：第一，许多人的资料是造假的，真实的刚性需求没那么多。第二，没有户口的刚需还是很多的，他们没有资格进入优先群。我相信，待到摇号时，还会有一部分人放弃，二居室160万以上的总价，确实不便宜。豆各庄的基础配套，甚至还不如六环外的一些小镇。住房子，住的是环境，住的是品质，不是单纯去住地段的。还因为，由于商品房价企稳甚至有所下调，许多购房者还会愿意买商品房，而不是自住房，毕竟自住房产权不完整，交易限制多。（三）一点建议最近，东南五环外的台湖地块，东亚台湖印象的住宅价格就跌到了22900，包含精装修，甚至由于客户少，根本卖不完，只好放缓开盘节奏。台湖位于通州区西南部，与恒大御景湾地块的距离，大概也就10公里以内。走京哈高速，不堵车的话，10多分钟就够了。地铁七号线未来还会向东延长到台湖区域的环球影城，所以，恒大御景湾其实除了身在朝阳区之外，好像优势并不明显。其实，倘若出得起22000，台湖比豆各庄强。台湖是熟地，市政重新规划，未来还有升值潜力。豆各庄是化工厂的老地，市政改造难度太大。况且不必摇号，开盘去付钱就是了，比自住房省事多了。听说还有个叫“绿地启航国际”的楼盘，15800起价，好像降了不少。而且距离地铁15号线南法信站可能只有800米（没去过实地，有待核实）。想那赵全营单价14000的自住房，周围几乎零配套，我觉得还不如绿地的这个楼盘。我倒不是为东亚和绿地做广告，只是这样的降价案例，如果由个案变成普遍，自住房在中短期内的升值空间将大打折扣。由于自住房比两限房贵得多，届时一些地段偏远的自住房会不会因为价格优势不再明显而滞销、烂掉，砸在手里，谁也说不清。【完】本贴转自：血拼自住商品房论坛社区论坛：http://house.focus.cn/msglist/2500017/原贴链接：http://house.focus.cn/msgview/2500017/295348887.html");
  
        Preprocess tmp = new Preprocess();
        tmp.setDocs(docs);
        tmp.settitles(titles);        
        tmp.initStopWordsAndStopNatures();
        tmp.analysisStr();
        
        
        InvertedIndexWords iiw = new InvertedIndexWords(tmp.getResult());
        iiw.run();
        
        
        
        PMI pmi = new PMI();
        List<Map<String,Double>> dics=new ArrayList<Map<String,Double>>();
        String pos = "out_positive.txt";
        String neg = "out_negtive.txt";
        pmi.SetDictionary(Dictionary.GetDictionary(pos));
        pmi.SetInvertedIndex(iiw.getIndex());
        pmi.setDocNum(2);
        pmi.SetInputWords(iiw.getWordList());
        pmi.setThreshold(0);   
        pmi.run();
        
        List<String> anslist =pmi.GetNewWords();
        Map<String,Double> ans = pmi.GetNewWordValue();
        System.out.println(ans);
        pmi.SetDictionary(Dictionary.GetDictionary(neg));
        pmi.SetInvertedIndex(iiw.getIndex());
        pmi.setDocNum(2);
        pmi.SetInputWords(iiw.getWordList());
        pmi.setThreshold(0);   
        pmi.run();
        
        List<String> anslist1 =pmi.GetNewWords();
        Map<String,Double> ans1 = pmi.GetNewWordValue();
        System.out.println(ans1);

        

        
    }
    public static void main(String []argvs){
        test.test4PMI();
    }
}